Autodesk.Revit.VSTA.ApplicationEntryPoint.AddinFolder
The full path to the Revit VSTA module.
Remarks:  This path should be used instead of the .NET GetExecutingAssembly() result, because
the VSTA module is loaded in such a way to make that result unreliable.

Autodesk.Revit.VSTA.ApplicationEntryPoint.OnShutdownEO
For Revit VSTA internal use only.

Autodesk.Revit.VSTA.ApplicationEntryPoint.FinishInitializationEO
For Revit VSTA internal use only.

Autodesk.Revit.VSTA.ApplicationEntryPoint.Initialize(System.Object,System.String)
For Revit VSTA internal use only.

Autodesk.Revit.VSTA.ApplicationEntryPoint
For Revit VSTA use only.

Autodesk.Revit.VSTA.ApplicationEntryPoint.GetRibbonPanels(System.String)
Get all the custom Panels on a designated Revit tab.
tabName: The name of the tab on which the panels are located.
Remarks:  Built-in panels will not be included. tabName must be the name of one of the tabs added
by Autodesk.Revit.UI.UIApplication.CreateRibbonTab(System.String).
This method is not supported in VSTA.

Autodesk.Revit.VSTA.ApplicationEntryPoint.GetRibbonPanels(Autodesk.Revit.UI.Tab)
Get all the custom Panels on a designated standard Revit tab.
tab: The tab on which the panels are located.
Remarks:  Built-in panels will not be included. This method is not supported in VSTA.

Autodesk.Revit.VSTA.ApplicationEntryPoint.GetRibbonPanels
Get all the custom Panels on Add-Ins tab of Revit.
Remarks:  The built-in panels won't be included and the panels added to tabs other than Add-Ins will not be included.
This method is not supported in VSTA.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonPanel(Autodesk.Revit.UI.Tab,System.String)
Create a new RibbonPanel on the designated standard Revit tab.
tab: The target tab, on which the new panel will be created.
panelName: The name of the panel to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: panelName is Empty or the tab is not valid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If more than 100 panels were created or the tab cannot be found.
Remarks:  This method will create a custom panel appending to the specified tab. This method is not supported in VSTA.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonPanel(System.String)
Create a new RibbonPanel on the Add-Ins tab.
panelName: The name of the panel to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: panelName is Empty.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If more than 100 panels were created.
Remarks:  This method will create a custom panel appending to the Revit AddIns tab. This method is not supported in VSTA.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonPanel(System.String,System.String)
Create a new RibbonPanel on the specified tab.
tabName: The name of the tab, on which the new panel will be created.
panelName: The name of the panel to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: tabName or panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: tabName or panelName is Empty.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Too many panels have been added to this tab (Maximum is 100).
Remarks:  This method will create a custom panel appending to the specified tab. This method is not supported in VSTA.

Autodesk.Revit.VSTA.ApplicationEntryPoint.CreateRibbonTab(System.String)
Creates a new tab on the Revit user interface.
tabName: The name of the tab to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: tabName or panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: tabName or panelName is Empty or the tab name duplicates the name of another tab in the Revit UI.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Too many custom tabs have been created in this session. (Maximum is 20).
Remarks:  This method will create a custom tab at the end of the list of static tabs. If multiple tabs are added, they will be shown in the order added. This method is not supported in VSTA.

Autodesk.Revit.VSTA.ApplicationEntryPoint.Idling
Subscribe to the Idling event to be notified when Revit is not in an active tool or transaction.
Remarks:
This event is raised when it is safe for the API application to access the active
document between user interactions. The event is raised only when the Revit UI is
in a state where the user could successfully click on an API command button.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
In order to change a document, you must begin a new transaction for that document.
This transaction will appear in the Revit undo stack and may be undone by the Revit user.
This event is invoked between user actions in the Revit UI. If the handler for
this event requires a significant amount of processing time, users will perceive a slowdown
in the responsiveness of Revit. If the execution for updates can be safely split across
multiple calls to this event, the user perception of Revit responsiveness will be improved.
Event is not cancellable.

Autodesk.Revit.VSTA.ApplicationEntryPoint.OpenAndActivateDocument(System.String)
Opens and activates a Revit document.
Remarks:
This method, if successful, changes the active document.
It is not allowed to have an open transaction in the active document when calling this method.
Consequently, this method can only be used in manual transaction mode, not in automatic mode.
Additionally, this method may not be called from inside an event handler.
fileName:
A full path to a revit file to be opened.
The file can be either a Revit project, template, of family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'fileName'.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given 'fileName' is not a Revit file (a project, template, or family document).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the active document is currently modifiable.
If an API event handler is currently being executed.
Since:
2012